Switch>
Switch>en
Switch>enable 
Switch#conf ter
Switch#conf terminal 
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#vtp domain CCNA
Domain name already set to CCNA.
Switch(config)#vtp mode server
Device mode already VTP SERVER.
Switch(config)#vtp password cisco
Password already set to cisco
Switch(config)#sh vtp status
                 ^
% Invalid input detected at '^' marker.
Switch(config)#^Z
Switch#sh v
00:09:13: %SYS-5-CONFIG_I: Configured from console by consoletp
% Incomplete command.
Switch#sh vtp st
Switch#sh vtp status 
VTP Version                     : 2
Configuration Revision          : 8
Maximum VLANs supported locally : 250
Number of existing VLANs        : 9
VTP Operating Mode              : Server
VTP Domain Name                 : CCNA
VTP Pruning Mode                : Disabled
VTP V2 Mode                     : Disabled
VTP Traps Generation            : Disabled
MD5 digest                      : 0x16 0x68 0xF2 0x0B 0x67 0x31 0x81 0x1B 
Configuration last modified by 0.0.0.0 at 3-1-93 00:40:06
Local updater ID is 0.0.0.0 (no valid interface found)

Switch#conf ter
Switch#conf terminal 
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#inter
Switch(config)#interface f0/1
Switch(config-if)#switch
% Incomplete command.
Switch(config-if)#switc 
Switch(config-if)#switchport mode trunk
Switch(config-if)#^Z
Switch#sh 
00:22:40: %SYS-5-CONFIG_I: Configured from console by consoleinter
Switch#sh interfaces trunk
Port        Mode         Encapsulation  Status        Native vlan
Fa0/1       on           802.1q         trunking      1
Fa0/2       desirable    802.1q         trunking      1
Fa0/3       auto         802.1q         trunking      1
Fa0/4       desirable    802.1q         trunking      1
Port      Vlans allowed on trunk
Fa0/1       1-4094
Fa0/2       1-4094
Fa0/3       1-4094
Fa0/4       1-4094
Port        Vlans allowed and active in management domain
Fa0/1       1,10,20,30,99
Fa0/2       1,10,20,30,99
Fa0/3       1,10,20,30,99
Fa0/4       1,10,20,30,99
Port        Vlans in spanning tree forwarding state and not pruned
Fa0/1       none
Fa0/2       none
Fa0/3       1,10,20,30,99

S2(config)# vlan 10
S2(config-vlan)# name Red
S2(config-vlan)# vlan 20
S2(config-vlan)# name Blue
S2(config-vlan)# vlan 30
S2(config-vlan)# name Yellow
S2(config-vlan)# vlan 99
S2(config-vlan)# name Management
S2(config-vlan)# end

S2(config)# interface f0/15
S2(config-if)# switchport mode access
S2(config-if)# switchport access vlan 20

S2(config)# interface vlan 99
S2(config-if)# ip address 192.168.99.2 255.255.255.0
S2(config-fi)# no shutdown

