Switch>en
Switch>enable 
Switch#conf ter
Switch#conf terminal 
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#no ip
Switch(config)#no ip dom
Switch(config)#no ip domain-
Switch(config)#no ip domain-s
Switch(config)#no ip domain-loo
Switch(config)#no ip domain-lookup 
Switch(config)#host 
Switch(config)#hostname S3
S3(config)#enab
S3(config)#enable pass
S3(config)#enable password class
S3(config)#line vty 0 15 
S3(config-line)#password cisco
S3(config-line)#exit
S3(config)#line console 0
S3(config-line)#password cisco
S3(config-line)#logg
S3(config-line)#logging synch
S3(config-line)#logging synchronous 
S3(config-line)#exit
S3(config)#banner motd # ban #
S3(config)#inter
S3(config)#interface vlan 1
S3(config-if)#ip add
S3(config-if)#ip address 192.168.1.3 255.255.255.0
S3(config-if)#no shut
S3(config-if)#no shutdown 
S3(config-if)#
00:33:18: %LINK-3-UPDOWN: Interface Vlan1, changed state to up
00:33:19: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan1, changed state to up
S3(config-if)#exit
S3(config)#exit
S3#c
00:33:26: %SYS-5-CONFIG_I: Configured from console by console
S3#copy runn
S3#copy running-config st
S3#copy running-config startup-config
Destination filename [startup-config]? 
Building configuration...
[OK]
S3 con0 is now available
Press RETURN to get started.
 ban 
S3>
S3 con0 is now available
Press RETURN to get started.
01:31:12: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/3, changed state to down
01:31:13: %LINK-3-UPDOWN: Interface FastEthernet0/3, changed state to down
01:31:29: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/4, changed state to down
01:31:30: %LINK-3-UPDOWN: Interface FastEthernet0/4, changed state to down
01:33:57: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/2, changed state to down
01:33:58: %LINK-3-UPDOWN: Interface FastEthernet0/2, changed state to down
01:34:09: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to down
01:34:10: %LINK-3-UPDOWN: Interface FastEthernet0/1, changed state to down ban 
S3>en
S3>enable 
Password: 
S3#sh inter
S3#sh interfaces des
S3#sh interfaces description 
Interface                      Status         Protocol Description
Vl1                            up             up       
Fa0/1                          down           down     
Fa0/2                          down           down     
Fa0/3                          down           down     
Fa0/4                          down           down     
Fa0/5                          down           down     
Fa0/6                          down           down     
Fa0/7                          down           down     
Fa0/8                          down           down     
Fa0/9                          down           down     
Fa0/10                         down           down     
Fa0/11                         down           down     
Fa0/12                         down           down     
Fa0/13                         down           down     
Fa0/14                         down           down     
Fa0/15                         up             up       
Fa0/16                         down           down     
Fa0/17                         down           down     
Fa0/18                         down           down     
Fa0/19                         down           down     
Fa0/20                         down           down     
Fa0/21                         down           down     
Fa0/22                         down           down     
Fa0/23                         down           down     
Fa0/24                         down           down     
Gi0/1                          down           down     
Gi0/2                          down           down     
S3#conf ter
S3#conf terminal 
Enter configuration commands, one per line.  End with CNTL/Z.
S3(config)#inter
S3(config)#interface f0/15
S3(config-if)#shutdown
S3(config-if)#ex
01:35:08: %LINK-5-CHANGED: Interface FastEthernet0/15, changed state to administratively down
01:35:09: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/15, changed state to down
S3(config-if)#exit
S3(config)#exit
S3#
01:35:13: %SYS-5-CONFIG_I: Configured from console by console
S3#conf ter
S3#conf terminal 
Enter configuration commands, one per line.  End with CNTL/Z.
S3(config)#inter
S3(config)#interface f0/1
S3(config-if)#sitch
S3(config-if)#switch
S3(config-if)#switchport mode trunk
S3(config-if)#exit
S3(config)#interface f0/2       
S3(config-if)#switch
S3(config-if)#switchport mode trunk
S3(config-if)#exit
S3(config)#interface f0/3       
S3(config-if)#switch
S3(config-if)#switchport mode 
S3(config-if)#switchport mode tr
S3(config-if)#switchport mode trunk  
S3(config-if)#exit
S3(config)#inter
S3(config)#interface f0/4
S3(config-if)#switch 
S3(config-if)#switchport mode
S3(config-if)#switchport mode trunk
S3(config-if)#switchport mode trunk 
S3(config-if)#exit
S3(config)#
01:44:11: %LINK-3-UPDOWN: Interface FastEthernet0/4, changed state to up
S3(config)#
01:44:13: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/4, changed state to up
S3(config)#
01:45:05: %LINK-3-UPDOWN: Interface FastEthernet0/2, changed state to up
S3(config)#
01:45:07: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/2, changed state to up
S3(config)#inter
S3(config)#interface f0/2
S3(config-if)#no shut
S3(config-if)#no shutdown 
S3(config-if)#exit
S3(config)#inter
S3(config)#interface f0/4
S3(config-if)#no shut
S3(config-if)#no shutdown 
S3(config-if)#exit
S3(config)#exit
S3#sh 
01:49:20: %SYS-5-CONFIG_I: Configured from console by console
S3#sh sp
S3#sh spanning-tree 
VLAN0001
  Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     0008.302d.4580
             Cost        19
             Port        4 (FastEthernet0/4)
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     0011.2142.4580
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time 300
Interface        Role Sts Cost      Prio.Nbr Type
---------------- ---- --- --------- -------- --------------------------------
Fa0/2            Desg FWD 19        128.2    P2p 
Fa0/4            Root FWD 19        128.4    P2p 
S3#
S3#
01:24:49: %SYS-5-CONFIG_I: Configured from console by console
S3#sh pa
S3#sh pa
% Incomplete command.
S3#sh s[
S3#sh s[
       ^
% Invalid input detected at '^' marker.
S3#sh sp
S3#sh spanning-tree 
VLAN0001
  Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     0008.302d.4580
             Cost        19
             Port        4 (FastEthernet0/4)
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     0011.2142.4580
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time 300
Interface        Role Sts Cost      Prio.Nbr Type
---------------- ---- --- --------- -------- --------------------------------
Fa0/2            Desg FWD 19        128.2    P2p 
Fa0/4            Root FWD 19        128.4    P2p 
S3#
S3 con0 is now available
Press RETURN to get started.
 ban 
S3>en
S3>enable 
Password: 
S3#en
S3#enable 
S3#conf ter
S3#conf terminal 
Enter configuration commands, one per line.  End with CNTL/Z.
S3(config)#inter
S3(config)#exit      
S3#sh s
01:40:56: %SYS-5-CONFIG_I: Configured from console by console
S3#sh sp
S3#sh spanning-tree 
VLAN0001
  Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     0008.302d.4580
             Cost        19
             Port        4 (FastEthernet0/4)
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     0011.2142.4580
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time 300
Interface        Role Sts Cost      Prio.Nbr Type
---------------- ---- --- --------- -------- --------------------------------
Fa0/2            Altn BLK 19        128.2    P2p 
Fa0/4            Root FWD 19        128.4    P2p 
S3#
S3 con0 is now available
Press RETURN to get started.
01:53:58: %LINK-3-UPDOWN: Interface FastEthernet0/3, changed state to up
01:54:00: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/3, changed state to up
01:54:44: %LINK-3-UPDOWN: Interface FastEthernet0/1, changed state to up
01:54:46: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to up ban 
S3>
S3>
S3>en
S3>enable 
Password: 
S3#en
S3#enable 
S3#conf ter
S3#conf terminal 
Enter configuration commands, one per line.  End with CNTL/Z.
S3(config)#inter
S3(config)#interface f0/1
S3(config-if)#no shut
S3(config-if)#no shutdown 
S3(config-if)#exit
S3(config)#interface f0/3
S3(config-if)#no
S3(config-if)#no shut
S3(config-if)#no shutdown 
S3(config-if)#exit
S3(config)#exit
S3#
01:55:34: %SYS-5-CONFIG_I: Configured from console by console
S3#sh sp
S3#sh spanning-tree 
VLAN0001
  Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     0008.302d.4580
             Cost        19
             Port        3 (FastEthernet0/3)
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     0011.2142.4580
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time 300
Interface        Role Sts Cost      Prio.Nbr Type
---------------- ---- --- --------- -------- --------------------------------
Fa0/1            Desg FWD 19        128.1    P2p 
Fa0/2            Desg FWD 19        128.2    P2p 
Fa0/3            Root FWD 19        128.3    P2p 
Fa0/4            Altn BLK 19        128.4    P2p 
S3#